docuSign/tmp/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.docusign.net/API/3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><SOAP-ENV:Header><wsa:Action>http://www.docusign.net/API/3.0/RequestStatuses</wsa:Action><wsa:To>https://www.docusign.net/api/3.0/api.asmx</wsa:To><wsa:MessageID>uudi:e81af4ec-72a1-f78d-93d8-5ea7519f1cf9</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2011-03-17T16:14:05Z</wsu:Created><wsu:Expires>2011-03-17T16:19:05Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken><wsse:Username>[TREE-b88ac21a-a6be-4bde-b342-c38933721a1e]f60c0df1-da9d-45e4-8dc5-5be00d7a52e4</wsse:Username><wsse:Password>Doc-4tron</wsse:Password><wsse:Nonce>hnnfUqbM2cvu1shkUgkL7sYkg5yeQVS4o9nkCm6q9zQ=</wsse:Nonce><wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2011-03-17T16:14:05Z</wsu:Created></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:RequestStatuses><ns1:EnvelopeStatusFilter><ns1:UserInfo><ns1:UserName>Chris Zhang</ns1:UserName><ns1:Email>czhang@treenosoftware.com</ns1:Email></ns1:UserInfo><ns1:AccountId>09d6de78-9471-449e-a301-fde4fc3e0688</ns1:AccountId><ns1:BeginDateTime xsi:nil="true"/><ns1:Statuses><ns1:Status>Any</ns1:Status></ns1:Statuses><ns1:EnvelopeIds><ns1:EnvelopeId>51b36c35-6e1d-4be5-85ed-efc4ceb1b4ee</ns1:EnvelopeId></ns1:EnvelopeIds><ns1:StartAtIndex xsi:nil="true"/></ns1:EnvelopeStatusFilter></ns1:RequestStatuses></SOAP-ENV:Body></SOAP-ENV:Envelope>
